//对欧拉函数求前缀和可得<=n的质数对

//质数N的欧拉函数是N-1 ，N^k 的欧拉函数是（N-1）*(N)^(k-1);

//欧拉定理 a,n互质时，a^(phi[n])=1（mod n）

//当n为素数时 a^(n-1)=1 mod n 此公式即 费马小定理
//=>a^(n-2) 为在mod数为n下的逆元

//phi[x] 一定是偶数 x>2

//小于或等于n的数中，与n互质的数的总和为：phi[x] * x / 2  (n>1)

//欧拉函数是积性函数――若m,n互质，phi(mn)=phi(n)*phi(m)，

//当n为奇数的时候，phi(2n)=phi(n)，由上可得 

//因为2必定和所有的奇数都是互质的，所以而phi(2)=1。所以得出这个结果

//若正整数 a,p 互质，则对于正整数 b,
//a^b mod p = a^(b mod phi(p)) mod p 

//当正整数 a,p 不一定互质时 
//a^b mod p =a^(b mod phi(p)+phi(p)) mod p (phi(p) ≤b)
